def f1(a, b, c=3):
    pass

f1(1, b=1, c=3)
f1(1, 2)
f1(1, 2, 1)
f1(1, 2, b=1)     # ПОМИЛКА: b передано як позиційний та іменований аргумент
f1(b=1, 1)        # ПОМИЛКА: позиційні аргументи йдуть перед іменованими
f1(1, c=5, b=1)   # ПОМИЛКА: порядок аргументів порушує логіку

def f2(a, /, b, *, c=3, d=4):
    pass

f2(4, d=5)
f2(4, 3, d=5)     # ПОМИЛКА: b повинен бути переданий як позиційний
f2(4, 3)
f2(4)             # ПОМИЛКА: b обов’язковий аргумент
f2(1, 2, 4)       # ПОМИЛКА: c і d повинні бути передані як іменовані
f2(1, 2, d=4, c=5)
